# key = [number of frames,
# frame width,
# list of frames duration,
# loop,
# if char can turn during animation,
# frame with punch and damage ]

# ['high_kick': [6, [55, 56, 45, 65, 88, 64], [1, 1, 1, 1, 3, 1], [], False, [[4], 'weak_hit', 50, [6, 0]]]
# high_kick - название удара
# 6 - количество спрайтов
# [55, 56, 45, 65, 88, 64] - расстояние от последнего пикселя одного спрайта до начала другого
# [1, 1, 1, 1, 3, 1] -время показа каждого слайда
# [], - цикл (его ставь как[] он для атак не нужен)
# False - может ли челик повернуться во время анимации у атак
# [[4], 'weak_hit', 50, [6, 0]]], - противодействие по-моему - 1-на каких кадрах наносится
# урон 2 - анимация получения урона от атаки 3 - урон 4 - вектор отбрасывания

# последние 4 значения однотипны и недоделаны(Санёк, займешься этим?))
cage_move_animations = {'stand': [7, [69] * 7, [1], [], True, False],
                        'walk_f': [9, [74, 60, 59, 60, 61, 59, 60, 61, 61], [1], [], True, False],
                        'walk_b': [9, [74, 60, 59, 60, 61, 59, 60, 61, 61], [1], [], True, False],
                        'jump': [3, [47, 62, 71], [1], [], True, False],
                        'move_jump': [8, [50, 49, 53, 58, 51, 49, 56, 62], [1], [], True, False],
                        'duck': [3, [77, 77, 56], [1], [], True, False],
                        'block': [2, [62, 50], [1], [], True, False],

                        # fix punches
                        'low_punch': [3, [73, 57, 75], [1], [], True, False],
                        'high_punch': [3, [62, 57, 68], [1], [], True, False],
                        'high_kick': [6, [63, 49, 47, 67, 80, 75], [1], [], True, False],
                        'low_kick': [5, [64, 63, 46, 66, 91], [1], [], True, False],
                        'uppercut': [5, [68, 63, 58, 41, 47], [1], [], True, False],
                        'sweep_kick': [7, [56, 56, 59, 91, 53, 78, 73], [1], [], True, False],
                        'roundhouse': [7, [49, 66, 73, 57, 38, 43, 66], [1], [], True, False],
                        # special move for johny kage
                        'egg_broken': [6, [86, 100, 109, 113, 113, 113], [1], [], True, False],
                        'air_kick': [2, [50, 50], [1], [], True, False],
                        'trip': [6, [77, 78, 77, 84, 82, 84], [1], [], True, False],
                        'stand_up': [5, [36, 49, 52, 78, 61], [1], [], True, False],
                        'slide': [6, [64, 47, 46, 67, 89, 89], [1], [], True, False],

                        'dead': [7, [60, 56, 56, 57, 56, 58, 58], [1], [], True, False]
                        }
